{
  "branding": {
    "title": "THE DAILY DEVELOPER",
    "strapLine": "Freshly Brewed Code for Muggles & Wizards Alike",
    "topLine": "programming news"
  },

  "frame": {
    "leftLabel": "From Bugs to Brilliance",
    "rightLabel": "Turning Ideas Into Interfaces",
    "bottomLabel": "Innovation in Progress"
  },
  "title": {
    "name": "Yaroslav Bezvesilnyi",
    "dividerLabel": "PORTFOLIO"
  },
  "instructions": {
    "title": "WEBSITE GUIDELINES",
    "items": [
      "All sections are clearly marked with titles, making it easy to find the information you need.",
      "The most important details are visually highlighted based on their relevance.",
      "Hard skills are presented as cards that can be toggled using arrow buttons.",
      "Most hard skills include related projects — clicking on them opens the corresponding project page.",
      "If you see a small triangle icon, it means additional info is available for that item.",
      "All of my projects are listed at the bottom of the page and displayed as cards with navigation arrows.",
      "This website is built using React."
    ]
  },
  "sections": {
    "personal_statement": {
      "title": "PERSONAL STATEMENT",
      "text": "Self-motivated <span class=\"highlight\">Software Systems Development</span> student with a strong foundation in <i>application development</i>, with several projects under my belt. Passionate about building <span class=\"highlight\">effective solutions</span> and eager to explore new technologies, frameworks, and optimization techniques to create great <span class=\"highlight\">user experiences</span>. My main interest lies in <span class=\"highlight\">back-end development</span>, as well as working with <span class=\"highlight\">databases</span> and improving <span class=\"highlight\">system efficiency</span>. I am motivated to <i>learn from experienced professionals, understand how the industry works, and gain both technical and soft skills while contributing to real-world projects</i>."
    },
    "skills": {
      "soft_skills": {
        "title": "SOFT SKILLS",
        "text": [
          {
            "title": "Teamwork",
            "description": "Took part in a project to develop a <b>random terrain generator</b> for a city computer science tournament (2nd place, December 2022). My role was to <b>generate ideas</b> and <b>identify logical bugs</b> in the code."
          },
          {
            "title": "Problem Solving",
            "description": "3rd place in the <b>Kharkiv regional olympiads in programming, maths and physics</b>. They improved my ability to solve non-standard problems and apply theoretical knowledge to complex tasks, as well as helped me develop <b>algorithms thinking</b>."
          },
          {
            "title": "Presentation Skills and Analytical Thinking",
            "description": "Took part in the <b>all-Ukrainian tournament of young inventors</b> (2nd place), where we defended our projects in front of an audience and critiqued other teams’ work"
          },
          {
            "title": "Documentation and Technical Writing",
            "description": "Wrote a <b>full documentation</b> for my coursework application, describing the development process in a structured way."
          },
          {
            "title": "Leadership",
            "description": "As a <b>class representative</b> at school, helped organise different events and improve class life."
          },
          {
            "title": "Languages",
            "description": "My native languages are Ukrainian and Russian. My <b>English level is B2 (with certificate)</b>."
          }
        ]
      },
      "hard_skills": {
        "title": "HARD SKILLS",
        "text": [
          {
            "title": "Python Django",
            "description": "Full Django MVT with PostgreSQL and optimised ORM, CBVs and mixins, custom auth, middleware, signals and permissions, Celery, Redis and Stripe.",
            "additional_information": "Experienced with the full Django MVT structure (models, views, templates, forms, URL routing, built-in authentication system and ORM), PostgreSQL and optimisation ORM queries. Used Class-Based Views and mixins, customised user models, and created custom authentication backends. Worked with both built-in and custom middleware, signals, permissions and access control. Set up Celery with Redis for background tasks and used Redis for caching, and implemented Stripe for payments and checkout logic. Organised projects with modular architecture, customised the admin panel, and managed static and media files",
            "projects": ["Online Tech Shop"]
          },
          {
            "title": "Databases and SQL",
            "description": "Relational design from conceptual to physical, CRUD, constraints and indexes, complex SQL (joins, subqueries, group/aggregate), ORM.",
            "additional_information": "Experienced in designing relational databases from scratch, from conceptual and logical design (entities, relationships, normalisation) to physical schema implementation in PostgreSQL or MySQL. Confident creating tables, altering structures, adding constraints, indexes, and relationships, inserting, updating and deleting data, writing complex SQL queries with joins, subqueries, grouping and aggregations. Used both raw SQL and ORM (Django), handled migrations and different relationships.",
            "projects": [
              "Advertisement App",
              "Online Tech Shop",
              "Task Manager"
            ]
          },
          {
            "title": "Python syntax",
            "description": "Core & advanced Python: control flow, function types, decorators, OOP, comprehensions, generators, async, testing, files & JSON.",
            "additional_information": "Confident in control flow, various types of functions (including lambdas and higher-order functions), decorators, OOP (classes, inheritance, dunder methods), comprehensions, generators. Worked with JSON, files and database connection. Familiar with error handling, unit testing, modules/packages structure and asynchronous code",
            "projects": ["Online Tech Shop", "Advertisement App"]
          },
          {
            "title": "C# .NET MAUI",
            "description": "Cross-platform apps with XAML + MVVM: layouts, navigation, styles and resources, Two-Way binding,  SQLite and date/time handling.",
            "additional_information": "Experienced in developing cross-platform applications using XAML-based interfaces and the MVVM pattern to separate logic and presentation. Worked with multiple layouts to structure adaptive pages, implemented navigation between different screens and applied shared styling through resources. Used data binding (including TwoWay) to connect UI and ViewModels and wrote additional logic in code-behind where necessary. Integrated SQLite for storing and retrieving local data and worked with dates and timestamps.",
            "projects": ["Task Manager"]
          },
          {
            "title": "C# syntax",
            "description": "C# OOP and generics, LINQ, exceptions, file I/O and JSON, Windows Forms basics, delegates, events, partial classes.",
            "additional_information": "Confident in OOP (classes, interfaces, inheritance, encapsulation) and different built-in collections and generics. Used LINQ for data filtering and transformation, implemented exception handling, and worked with file I/O and JSON. Familiar with Windows Forms, worked with forms, events, UI components and basic app logic. Familiar with delegates, events and partial classes. Projects: enroller handbook, task manager",
            "projects": ["Task Manager", "Enroller Handbook"]
          },
          {
            "title": "HTML, CSS, JavaScript",
            "description": "Semantic HTML, responsive CSS (Flexbox, Grid, positioning, media queries and animations), modern JS, DOM, fetch/async, storage, validation.",
            "additional_information": "Experienced in semantic markup, forms, tables, lists, media elements and meta tags. Build responsive layouts using Flexbox, Grid, positioning, media queries, pseudo-elements and animations. In JavaScript, use modern features (e.g. arrow functions), DOM manipulation, events, Fetch API with async/await, LocalStorage, JSON parsing, form validation, date handling and error management. Worked with front-end plugins and UI libraries, including Semantic UI, and have a basic understanding of React and the component-based approach.",
            "projects": [
              "Movie Catalog",
              "Online Tech Shop",
              "Personal Website"
            ]
          },
          {
            "title": "Tools & Environments",
            "description": "Git/GitHub workflows, Linux CLI and system basics, Qt Designer, Blender, Microsoft Office.",
            "additional_information": "Confident using Git and GitHub for version control, branching and collaboration. Comfortable working in Linux environments (terminal commands, filesystem navigation, permissions, process management, basic networking tools, and package management). Basic experience with Qt Designer for building UI layouts, Blender for simple 3D edits, and Microsoft Office for documentation and presentations.",
            "projects": []
          },
          {
            "title": "Data Structures and Algorithms",
            "description": "Core data structures, sorting, searching, recursion, complexity analysis and practical optimisation.",
            "additional_information": "Confident working with arrays, linked lists, stacks, queues, hash tables, trees and graphs. Understand sorting and searching algorithms, recursion, complexity analysis and algorithmic optimisation.",
            "projects": [
              "Online Tech Shop",
              "Task Manager",
              "Advertisement App",
              "Enroller Handbook",
              "Movie Catalog",
              "Personal Website"
            ]
          },
          {
            "title": "Data Analytics",
            "description": "NumPy vectorisation, Pandas cleaning, merge, group, filter and Matplotlib for charts and exploratory analysis.",
            "additional_information": "Confident in using NumPy for numerical operations, vectorised calculations and array manipulation, and Pandas for working with tabular data, grouping, filtering, merging and cleaning datasets. Used Matplotlib to visualise trends, build charts and explore data patterns.",
            "projects": []
          }
        ]
      },
      "education": {
        "title": "EDUCATION",
        "text": [
          {
            "institution": "SOUTH EAST TECHNOLOGICAL UNIVERSITY",
            "location": "Waterford, Ireland",
            "years": "2024 - 2027",
            "degree": "Bachelor of Science in Software Systems Development",
            "course_info": "https://www.setu.ie/courses/bsc-hons-in-software-systems-development",
            "focus": "Main focus is on software engineering process, tools, programming concepts, creative problem solving and UX design.",
            "average_grade": "92.6%"
          },
          {
            "institution": "KHARKIV LYCEUM NO. 122",
            "location": "Kharkiv, Ukraine",
            "years": "Graduated in 2023 (with honours)",
            "details": "Finished school with almost the highest marks for final exams, participated in national and regional olympiads and technical competitions, consistently placing highly, including many 1st places."
          }
        ]
      }
    },
    "projects": {
      "title": "PROJECTS",
      "items": [
        {
          "slug": "tech-shop",
          "title": "Tech Shop (Main Project)",
          "short_description": "A full-featured <span class=\"highlight\">e-commerce platform</span> with multi-level categories, <span class=\"highlight\">recommendation system</span>, advanced search, <span class=\"highlight\">Stripe</span> integration, and admin management tools. Users can browse, filter, and purchase products, manage their profile and orders, or even create and sell their <span class=\"highlight\">own products</span>, all with real-time updates and <span class=\"highlight\">notifications</span>. Also there is  <span class=\"highlight\">a course system</span> with ability to manage modules and contents.",
          "tech": "Python, Django, PostgreSQL, Redis, Celery, Stripe API, HTML, CSS, JS (Vanilla + AJAX), Template Tags, Custom Middleware, Signals, Context Processors, Caching",
          "detailed_description": {
            "introduction": "This is a <span class=\"highlight\">complex multi-purpose</span> online shop built with Django, where users can browse, filter, and<span class=\"highlight\"> buy</span> products, as well as manage their <span class=\"highlight\">own sales and educational courses</span>.",
            "features": [
              "Structured <span class=\"highlight\">multi-level</span> categories and brands, where each big category has subcategories and brands have their pages with ability to <span class=\"highlight\">subscribe for news</span>.",
              "Smart <span class=\"highlight\">recommendation system</span> that suggest similar products and popular products.",
              "<span class=\"highlight\">Advanced filtering</span> for products in category that based on the existing characteristics, their values, brands and price range in that category, and <span class=\"highlight\">advanced searching</span> for products and categories with <span class=\"highlight\">highlighting query</span>.",
              "<span class=\"highlight\">Pagination</span> and <span class=\"highlight\">endless scroll</span> for long lists.",
              "Advanced product page that shows detailed info, has <span class=\"highlight\">custom image modal viewer</span> and <span class=\"highlight\">reviews</span> tab with ability to manage and filter them.",
              "Logging and registration with ability to <span class=\"highlight\">reset password</span>, stay logged in for long time and sign in with <span class=\"highlight\">Google</span>.",
              "<span class=\"highlight\">Carts</span> with full logic, including quantity control, <span class=\"highlight\">stock limits</span>, <span class=\"highlight\">coupon system</span>, checkout, Stripe and <span class=\"highlight\">Stripe webhook</span> integration for updating database.",
              "<span class=\"highlight\">Admin panel</span> with ability to manage each item, search and export to CSV.",
              "User <span class=\"highlight\">profiles</span> with many tabs with ability to <span class=\"highlight\">add own products</span>, manage them and view other people’s <span class=\"highlight\">actions</span> on them.",
              "<span class=\"highlight\">Courses platform</span> with ability to add your own courses, fill in with modules and various content, mange order of content by <span class=\"highlight\">dragging</span> items and <span class=\"highlight\">enrol</span> other courses.",
              "<span class=\"highlight\">Asynchronous and optimized backend</span> with background jobs, caching, different query optimisation, automatic and manual <span class=\"highlight\">email sending</span> and custom commands for terminal."
            ],
            "screenshots": [
              "/img/projects/tech-shop/01-main.png",
              "/img/projects/tech-shop/02-category.png",
              "/img/projects/tech-shop/03-brand.png",
              "/img/projects/tech-shop/04-subcategory.png",
              "/img/projects/tech-shop/05-product.png",
              "/img/projects/tech-shop/06-search.png",
              "/img/projects/tech-shop/07-cart.png",
              "/img/projects/tech-shop/08-login.png",
              "/img/projects/tech-shop/09-profile.png",
              "/img/projects/tech-shop/10-courses.png",
              "/img/projects/tech-shop/11-course-manage.png",
              "/img/projects/tech-shop/12-admin-panel.png"
            ]
          },
          "links": {
            "git_hub": "https://github.com/YarBez12/Tech-shop",
            "live": "https://tech-shop-6x1q.onrender.com/"
          }
        },
        {
          "slug": "task-manager",
          "title": "Task Manager",
          "short_description": "A <span class=\"highlight\">cross-platform</span> app for creating and managing tasks and corresponding exercises for each task. User can toggle completion status, set the order of exercises, see <span class=\"highlight\">schedule</span> in a calendar-view format and manage it. The UX is clear with <span class=\"highlight\">colour-coded scheduling</span> and different <span class=\"highlight\">error preventions</span>.",
          "tech": "C#, .Net MAUI, MVVM Architecture, SQLite percistance, XAML files, Asynchronous programming, Dependency injection, OOP",
          "detailed_description": {
            "introduction": "This project shows my ability to create <span class=\"highlight\">multiplatform apps</span> using <span class=\"highlight\">.Net MAUI</span>. This app has 3 main tabs: Current tasks, Completed tasks and Schedule, making it easier to organize work, track progress, and plan ahead.",
            "features": [
              "Adding tasks and connected exercises and <span class=\"highlight\">managing</span> them in various ways, such as setting <span class=\"highlight\">deadlines</span>, <span class=\"highlight\">priority</span> for tasks, and dates and <span class=\"highlight\">order</span> for exercises, as well as toggling their completion status.",
              "Smart <span class=\"highlight\">schedule page</span>: daily view with <span class=\"highlight\">colour-coded exercises</span> and <span class=\"highlight\">automatic midnight updates</span>.",
              "<span class=\"highlight\">Filtering</span> and <span class=\"highlight\">sorting</span> of tasks by category, overdue statuses and other parameters.",
              "<span class=\"highlight\">Copy & paste</span> functionality for exercises with a <span class=\"highlight\">buffer implementation</span>.",
              "UX built with <span class=\"highlight\">XAML layouts</span>, multiple <span class=\"highlight\">data bindings</span>, <span class=\"highlight\">value convertors</span> and validation, including <span class=\"highlight\">async</span> updates, real-time status changes and error prevention.",
              "Data storage in <span class=\"highlight\">SQLite</span> using .NET MAUI approach."
            ],
            "screenshots": [
              "/img/projects/tasks-manager/01-current-tasks.png",
              "/img/projects/tasks-manager/02-task-details.png",
              "/img/projects/tasks-manager/03-add-task.png",
              "/img/projects/tasks-manager/04-schedule-page.png",
              "/img/projects/tasks-manager/05-add-exercise.png",
              "/img/projects/tasks-manager/06-filter-popup.png"
            ]
          },
          "links": {
            "git_hub": "https://github.com/YarBez12/Task-Manager",
            "live": "https://github.com/YarBez12/Task-Manager/releases/download/v1.0/TasksManager.apk"
          }
        },
        {
          "slug": "movie-catalog",
          "title": "Movie Catalog",
          "short_description": "A website to browse a movie catalog with <span class=\"highlight\">search</span>, <span class=\"highlight\">filters</span>, and <span class=\"highlight\">sorting</span>. Users can <span class=\"highlight\">add</span> or <span class=\"highlight\">edit movies</span>, leave <span class=\"highlight\">comments</span> and <span class=\"highlight\">reviews</span>, and try a random <span class=\"highlight\">quiz</span>. All data is displayed in a clear, organized way with <span class=\"highlight\">validation</span> and duplicate protection.",
          "tech": "JS basics, Handlebars (Templating), Many plugins (such as Fuse.js, Toastify, Slick Carousel and so on), use of LocalStorage, HTML, CSS (including Fomantic UI) and CSS animations",
          "detailed_description": {
            "introduction": "This project was created as a <span class=\"highlight\">university assignment</span> at <span class=\"highlight\">SETU</span> to demonstrate my skills in building <span class=\"highlight\">interactive web applications</span> with <span class=\"highlight\">JavaScript</span> and various plugins. The site includes four main pages: Home, Movie Catalog, Movie Details, and Author Information.",
            "features": [
              "<span class=\"highlight\">Add</span> / <span class=\"highlight\">Edit</span> / <span class=\"highlight\">Delete</span> movies, comments, and reviews with strong <span class=\"highlight\">validation</span> and <span class=\"highlight\">duplicate prevention</span>",
              "<span class=\"highlight\">Filtering</span>, <span class=\"highlight\">sorting</span>, and advanced <span class=\"highlight\">search</span> with reset option",
              "Dynamic pages rendered via <span class=\"highlight\">Handlebars</span> templating",
              "Persistent data via <span class=\"highlight\">LocalStorage</span>",
              "Extra engagement: smooth <span class=\"highlight\">animations</span> and a <span class=\"highlight\">Movie Quiz</span>",
              "Image UX with <span class=\"highlight\">lightGallery</span> and a <span class=\"highlight\">before/after slider</span>"
            ],
            "screenshots": [
              "/img/projects/movie-catalog/01-home.png",
              "/img/projects/movie-catalog/02-filters.png",
              "/img/projects/movie-catalog/03-modal.png",
              "/img/projects/movie-catalog/04-film-info.png",
              "/img/projects/movie-catalog/05-quiz-and-review.png"
            ]
          },
          "links": {
            "git_hub": "https://github.com/YarBez12/Movie-Catalog-CA1",
            "live": "https://20113257-movie-catalog-ca.netlify.app/"
          }
        },
        {
          "slug": "advertisement-agency",
          "title": "Advertisement Agency",
          "short_description": "A <span class=\"highlight\">full desktop app</span> built with PyQt5 to manage clients, campaigns, advertisements, users, and media platforms. <span class=\"highlight\">Admins</span> can manage all tables with complete <span class=\"highlight\">CRUD</span> functionality (with error prevention), view <span class=\"highlight\">related tables</span> for each entity, while clients can add new campaigns and generate <span class=\"highlight\">reports</span>, and users can see advertisements linked to their media platforms.",
          "tech": "SQL (pyodbc), Python, PyQt5, MVC, OOP, PDF/Excel generation",
          "detailed_description": {
            "introduction": "This is a <span class=\"highlight\">desktop app</span> (built with PyQt5) developed as my <span class=\"highlight\">university assignment</span> that shows my skill in <span class=\"highlight\">database manipulation</span> and building a complete application for real-world data interaction. It combines several <span class=\"highlight\">user roles</span>, each has different rights and capabilities.",
            "features": [
              "<span class=\"highlight\">MVC</span> architecture and different <span class=\"highlight\">design patterns</span> for clean structure, maintainability, and data control.",
              "Full <span class=\"highlight\">CRUD</span> functionality for all entities with robust validation and error handling.",
              "<span class=\"highlight\">Role-based access</span> (admin, client, user) defining available features and permissions.",
              "Detailed entity pages displaying all <span class=\"highlight\">related</span> tables with ability to add new or existing linked records.",
              "Automated updates of related data and entity dependencies.",
              "Sorting, filtering, searching, and smooth navigation between connected tables.",
              "<span class=\"highlight\">Raw SQL</span> queries with full SQL <span class=\"highlight\">injection protection</span> and encapsulated connection lifecycle.",
              "<span class=\"highlight\">PDF/Excel report</span> generation and real-time ad metrics tracking.",
              "Simple users can view their related media platforms and corresponding advertisements."
            ],
            "screenshots": [
              "/img/projects/advertisement-agency/01-main.png",
              "/img/projects/advertisement-agency/02-campaigns-table.png",
              "/img/projects/advertisement-agency/03-platform-window.png",
              "/img/projects/advertisement-agency/04-client-form.png",
              "/img/projects/advertisement-agency/05-client-view.png",
              "/img/projects/advertisement-agency/06-user-view.png"
            ]
          },
          "links": {
            "git_hub": "https://github.com/YarBez12/Advertisement-Agency1",
            "live": ""
          }
        },
        {
          "slug": "enroller-handbook",
          "title": "Enroller Handbook",
          "short_description": "A <span class=\"highlight\">Windows app</span> for exploring universities and related courses, sort, search and filter them, and add to favourites. Users can <span class=\"highlight\">add</span> their own universities and courses with good <span class=\"highlight\">error prevention</span>, <span class=\"highlight\">export</span> data to text files and see their competitive score.",
          "tech": "C#, OOP, Windows Forms, JSON persistence, MVC structure",
          "detailed_description": {
            "introduction": "This is an app built as my <span class=\"highlight\">university assignment</span> to show my <span class=\"highlight\">OOP</span> skills and practical <span class=\"highlight\">C#</span> development. This app includes a collection of universities and related courses with all appropriate information.",
            "features": [
              "Using <span class=\"highlight\">MVC</span> method and <span class=\"highlight\">OOP</span> principles for organising code",
              "Persistant data via <span class=\"highlight\">JSON files</span>",
              "<span class=\"highlight\">Adding, editing</span> and <span class=\"highlight\">deleting</span> universities and courses of own choice with error prevention and data handling",
              "<span class=\"highlight\">Sorting, filtering</span> and <span class=\"highlight\">searching</span> by different criteria",
              "<span class=\"highlight\">Exporting</span> different information to text files",
              "Adding <span class=\"highlight\">notes</span> to courses and creating favourite lists",
              "<span class=\"highlight\">Calculating competitive score</span> for each course based on its coefficients "
            ],
            "screenshots": [
              "/img/projects/enroller-handbook/01-universities.png",
              "/img/projects/enroller-handbook/02-university-page.png",
              "/img/projects/enroller-handbook/03-add-course.png",
              "/img/projects/enroller-handbook/04-course-page.png",
              "/img/projects/enroller-handbook/05-calculator.png"
            ]
          },
          "links": {
            "git_hub": "https://github.com/YarBez12/Enrolle-Handbook",
            "live": ""
          }
        }
      ]
    }
  }
}
